---
kind: type
id: T:Autodesk.Revit.DB.ExternalResourceServiceUtils
source: html/46c03f8a-7ca7-56f7-e6df-d8931a4727c2.htm
---
# Autodesk.Revit.DB.ExternalResourceServiceUtils

Contains utilities related to external resource service.

## Syntax (C#)
```csharp
public static class ExternalResourceServiceUtils
```